export type NavLink = {
  route: string;
  label: string;
  subRoutes?: {
    route: string;
    label: string;
  }[];
};

export const navLinks: NavLink[] = [
  {
    route: "/curriculum",
    label: "পাঠ্যক্রম",
    subRoutes: [
      { route: "/teacher", label: "টিচার লিস্ট" },
      { route: "/course-structure", label: "কোর্স অবকাঠামো" },
      { route: "/grading", label: "গ্রেডিং সিস্টেম" },
    ],
  },
  {
    route: "/admission-process",
    label: "ভর্তি প্রক্রিয়া",
    subRoutes: [
      { route: "/admission-eligibility", label: "ভর্তির যোগ্যতা" },
      { route: "/admission-policies", label: "ভর্তির নীতিমালা" },
      { route: "/application-process", label: "আবেদন প্রক্রিয়া" },
      { route: "/tuition-fees-and-others", label: "টিউশন ফি ও অন্যান্য" },
    ],
  },
  {
    route: "/administrative-activities",
    label: "প্রশাসনিক কার্যক্রম",
    subRoutes: [
      { route: "/administrative-committee", label: "প্রশাসনিক কমিটি" },
    ],
  },

  {
    route: "/technologies",
    label: "টেকনোলজি সমূহ",
    subRoutes: [
      { route: "/admission-eligibility", label: "ইলেকট্রিক্যাল টেকনোলজি" },
      { route: "/admission-policies", label: " মেকানিক্যাল টেকনোলজি" },
      { route: "/application-process", label: "   কম্পিউটার টেকনোলজি" },
      { route: "/tuition-fees-and-others", label: " অটোমোবাইল টেকনোলজি " },
      { route: "/tuition-fees-and-others", label: " সিভিল টেকনোলজি " },
    ],
  },
  {
    route: "/conveniences",
    label: "সুবিধা",
  },
  {
    route: "/",
    label: "গ্যালারি",
    subRoutes: [
      { route: "/admission-eligibility", label: "ভর্তির যোগ্যতা" },
      { route: "/admission-policies", label: "ভর্তির নীতিমালা" },
      { route: "/application-process", label: "আবেদন প্রক্রিয়া" },
      { route: "/tuition-fees-and-others", label: "টিউশন ফি ও অন্যান্য" },
    ],
  },
  {
    route: "/our-world",
    label: "আমাদের ভবন",
    subRoutes: [
      { route: "/application-process", label: "আমাদের সম্পর্কে" },
      { route: "/chairman", label: "চেয়ারম্যানের বাণী" },
      { route: "/principle", label: "অধ্যক্ষের কথা" },

      { route: "/tuition-fees-and-others", label: "আমাদের লক্ষ্য" },
      { route: "/tuition-fees-and-others", label: " প্রজেক্ট সমূহ" },
    ],
  },
  {
    route: "/contact-us",
    label: "যোগাযোগ",
    subRoutes: [
      { route: "/admission-eligibility", label: "ভর্তির যোগ্যতা" },
      { route: "/admission-policies", label: "ভর্তির নীতিমালা" },
      { route: "/application-process", label: "আবেদন প্রক্রিয়া" },
      { route: "/tuition-fees-and-others", label: "টিউশন ফি ও অন্যান্য" },
    ],
  },
];

export const chairmansMessage = {
  picture: "/chairman.jpeg",
  name: "এম. রেজাউল করিম চৌধুরী (বীর মুক্তিযোদ্ধা)",
  position: "প্রতিষ্ঠাতা ও চেয়ারম্যান",
  institute: "সামশুন নাহার হারুন পলিটেকনিক ইনিস্টিটিউট।",
  message:
    'দারিদ্রদ্র্য বিমোচন, কর্মসংস্থানের সুযোগ সৃষ্টি, আত্ম-কর্মসংস্থান, বেকারত্ব, ক্ষুধা ও দুর্নীতিমুক্ত সমৃদ্ধ বাংলাদেশ গড়া, উদ্যোক্তা, উন্নয়ন ও উৎপাদনশীলতা বৃদ্ধিতে কারিগরি ও বৃত্তিমূলক শিক্ষার ভূমিকা অপরিসীম। কারিগরি শিক্ষা জাতির অর্থনৈতিক মেরুদন্ড, জাতির অধিকার। বঙ্গবন্ধু শেখ মুজিবুর রহমান সোনার বাংলা বলতে পরিপূর্ণ বাংলাদেশকে বুঝিয়েছেন। এখন তারই সুযোগ্য কন্যা সেই অসমাপ্ত সোনার বাংলার সত্যিকারের রূপ "ডিজিটাল বাংলাদেশ" গড়তে কাজ করছেন নিরন্তর। বাংলাদেশকে মধ্যম আয়ের দেশে উন্নীত করার জন্য কারিগরি ও বৃত্তিমূলক শিক্ষার সম্প্রসারণ অপরিহার্য। এক সময়ে বাংলাদেশের সমপর্যায়ে থাকা মালয়েশিয়া, দক্ষিণ কোরিয়া, সিংগাপুর, হংকং, ভিয়েতনাম, জাপান, চীন, ভারতসহ আরো অনেক দেশ আজ কারিগরি ও বৃত্তিমূলক শিক্ষাকে গুরুত্ব দিয়ে ব্যাপকভাবে উন্নতি সাধন করেই সাফল্যের দ্বারপ্রান্তে পৌঁছাতে সক্ষম হয়েছে। দক্ষিণ কোরিয়ার মোট শ্রমশক্তির ৯৬ ভাগই কারিগরি শিক্ষায় প্রশিক্ষিত, জার্মানিতে ৮০ ভাগ, ইউরোপে এই হার ৬০ শতাংশের বেশি আর শিল্পোন্নত দেশে ৬০- ৮০ ভাগ। বিপরীতে আমাদের দেশে বর্তমান সরকারের যুগোপযোগী শিক্ষানীতি, বৃত্তিমূলক ও কারিগরি শিক্ষার প্রসার ও উন্নয়নে নানামুখী পরিকল্পনা বাস্তবায়নের ফলে এই হার ০৬ ভাগে উন্নীত হয়েছে।  জাতীয় দারিদ্র্য বিমোচন কৌশলপত্রে ২০২০ সালের মধ্যে মোট শিক্ষার্থীর শতকরা ২০ ভাগ ও ২০৩০ সালের মধ্যে শতকরা ৩০ ভাগ কারিগরি ও বৃত্তিমূলক শিক্ষায় অর্ন্তভূক্ত করার লক্ষ্যমাত্রা সরকারের পক্ষে নির্ধারণ করা হয়েছে। গত ১৫ এপ্রিল ২০১৭ইং শনিবার চট্টগ্রাম ক্লাব মিলনায়তনে এক অনুষ্ঠানে মাননীয় শিক্ষামন্ত্রী ২০২০ সালের মধ্যে মোট শিক্ষার্থীর ৬৫ শতাংশকে কারিগরি ও বৃত্তিমূলক শিক্ষায় অর্ন্তভূক্ত করার পরিকল্পনার কথা জানান। এই পরিকল্পনা বাস্তবায়ন হলে বাংলাদেশে শিল্প, শিক্ষা, চিকিৎসা, সাহিত্য, সাংস্কৃতিক, তথ্য-প্রযুক্তি, অর্থনৈতিক ও কর্মসংস্থানে বৈপ্লবিক পরিবর্তন ঘটবে। সরকারের রাজস্ব আয় ১৩০ গুন বৃদ্ধি পাবে! মানুষের বার্ষিক মাথাপিছু আয় ৭০-৮০ হাজার ডলারে উন্নতি ঘটবে! জাতিয় প্রবৃদ্ধি ১২-১৪তে উঠানামা করবে! সরকারের এই পরিকল্পনা বাস্তবায়ন করতে হলে কারিগরি শিক্ষা ক্ষেত্রে ১৯৭১ সালের মুক্তিযুদ্ধের ন্যায় একটি বিপ্লব ঘটাতে হবে। দেশের প্রতিটি বিভাগে বর্তমান কারিগরি শিক্ষা বোর্ড, ঢাকা এর অনুরূপ একটি করে কারিগরি শিক্ষা বোর্ড স্থাপন করে শহর, নগর, পৌরসভা ও ইউনিয়ন পর্যায়ে কারিগরি স্কুল ও কলেজ প্রতিষ্ঠা করে কারিগরি শিক্ষাকে মানুষের দোরগোড়ায় পৌঁছিয়ে দিতে হবে। বেসরকারি কারিগরি শিক্ষা প্রতিষ্ঠানে সরকারী আর্থিক সহায়তা ও মান নিয়ন্ত্রণ জোরদার করতে হবে। দেশে প্রয়োজনের তুলনায় কারিগরি শিক্ষা প্রতিষ্ঠান খুবই নগন্য। তথাপি দুঃখজনক হলেও সত্য যে, ব্যবসায়িক মনোবৃত্তির কারণে বেসরকারি পর্যায়ে অধিকাংশ কারিগরি শিক্ষা প্রতিষ্ঠানগুলোর শিক্ষার মান নিম্নমানের। বিপরীতে ছাত্র/ছাত্রীদের কাছ থেকে হাতিয়ে নিচ্ছে লক্ষ-লক্ষ টাকা। কিন্তু শিক্ষা কোন পণ্য নয় তাই শিক্ষা নিয়ে ব্যবসা নয়। এরই পরিপ্রেক্ষিতে চট্টগ্রামের গরীব, মধ্যবিত্ত ও মেধাবী ছাত্র/ছাত্রীদেরকে কম খরচে কারিগরি শিক্ষায় প্রশিক্ষিত করে দক্ষ ও যোগ্য জনশক্তি তৈরীর মাধ্যমে সমৃদ্ধ ডিজিটাল বাংলাদেশ গড়ার প্রত্যয় নিয়ে চট্টগ্রামের প্রাণকেন্দ্র, প্রাচীন ও ঐতিহ্যবাহী বহরদার হাট এলাকায় নিজস্ব জায়গায় আমার পরম শ্রদ্ধেয় মা ও বাবার নামে প্রতিষ্ঠিত হয়েছে, সামশুন নাহার হারুন পলিটেকনিক ইনস্টিটিউট"। আমার পূর্ব পুরুষেরাও অতীতে অত্র এলাকায় বিভিন্ন শিক্ষা প্রতিষ্ঠান ও শিক্ষার সম্প্রসারণের জন্য জায়গা-জমি দান করেছেন। তাই ঐতিহ্যবাহী বহরদার বাড়ির সন্তান হিসেবে উত্তরাধিকার সূত্রে প্রাপ্ত এবং আমার অর্জিত অর্থ ও সম্পদ আমি ভবিষ্যত ডিজিটাল বাংলাদেশ গড়ার কারিগরদের উদ্দেশে ব্যয় করতে চাই। আবারও বলছি, অন্যদের মত ব্যবসা নয়, গুনগত মানসম্পন্ন কারিগরি শিক্ষায় প্রশিক্ষিত জনশক্তি তৈরী করাই আমার উদ্দেশ্য। কারিগরি শিক্ষায় নিয়োজিত সকল ব্যক্তি ও প্রতিষ্ঠানকে ধন্যবাদ জানাচ্ছি। আমার প্রিয় চট্টগ্রামবাসীকে শুভেচ্ছা ও স্বাগতম। বিশেষ করে সেই সব অভিভাবক ও ছাত্র/ছাত্রী যারা একবিংশ শতাব্দীর চ্যালেঞ্জ মোকাবেলায় কারিগরি শিক্ষায় প্রশিক্ষিত হয়ে সুখী-সমৃদ্ধ ডিজিটাল বাংলাদেশ গড়তে চায়। এই স্বপ্ন পূরণে একজন মুক্তিযোদ্ধা, রাজনীতিবিদ ও সচেতন নাগরিক হিসেবে আমি সর্বদা সচেষ্ট।  ',
  last_message: "জয়বাংলা - বাংলাদেশ চিরজীবী হোক।",
} as const;
export const principleMessage = {
  picture: "/chairman.jpeg",
  name: "(ইঞ্জিনিয়ার মোঃ আজিজুল হক)",
  position: "অধ্যক্ষ",
  institute: "বি.এসসি-ইন- টেক্সটাইল ইঞ্জিনিয়ারিং (BUTex) ",
  more_institue: "এম এন্ড টি, পিকিং ইউনিভার্সিটি (চায়না)।",
  message:
    "লাখো শহীদের রক্তে ভেজা স্বাধীন এদেশ, বাংলাদেশ। পৃথিবীর মানচিত্রে ছোট্ট একটি দেশ, হাজারো ঐতিহ্যে ঘেরা প্রাকৃতিক সৌন্দর্যেভরা। নাতিশীতোষ্ণ জলবায়ু, সম্পদ সীমিত। বিশ্বের সর্বাধিক ঘনবসতিপূর্ণ এদেশ। ৪০% মানুষ দারিদ্র্য সীমার নীচে বসবাস করে এবং প্রায় ৪৫% লোক বেকার। নির্মম বেকারত্বের অভিশাপে ভূগছে এদেশের মানুষ, এদেশের যুব সমাজ। বেকার সে নিজের কাছে অপরাধী, সে পরিবারের দুঃখ, পরিবারের কান্না, দেশের বোঝা। বেকার জীবনের গ্লানি বড় বেদনাদায়ক, বড় দূর্বিসহ। ফলে বাড়ছে অস্থিরতা, সংঘটিত হচ্ছে নানা অপরাধ। দিন দিন মানুষ অসহায় হয়ে পড়ছে। উন্নত দেশ যেমন জাপানে বেকারত্বের হার ৫% , যুক্তরাজ্যে ৭%, যুক্তরাষ্ট্রে ৯% আর বাংলাদেশে বেকারত্বের হার প্রায় ৪৫%। সরকারি চাকুরী সীমিত। ইচ্ছা থাকা সত্ত্বেও, শিক্ষা থাকা সত্ত্বেও, শিক্ষিত যুব সমাজ খুঁজে পাচ্ছেনা কাজ। ফলে জীবনে নেমে এসেছে হতাশা ও ক্ষোভ। জাতির এ ক্রান্তিলগ্নে ও সংকট মুহুর্তে পথহারা ছাত্র সমাজের উজ্জ্বল ভবিষ্যৎ রচনার লক্ষ্যে তথা ভবিষ্যতে কর্মসংস্থান তৈরীর লক্ষ্যে যে প্রতিষ্ঠানটি হাল ধরেছে সেটি হল আর্ন্তজাতিক মান, প্রযুক্তিগত জ্ঞান ও দক্ষতা সম্পন্ন একটি অনন্য প্রতিষ্ঠান সামশুন নাহার হারুন পলিটেকনিক ইনস্টিটিউট চট্টগ্রাম। সর্বাগ্রে একটি কথা স্মরন রাখার মত যে, কখনোই কারিগরি স্বল্প ধারনা নিয়ে দক্ষতা ছাড়া কাজ খুঁজে পাওয়া যায় না। কর্মসংস্থানের ব্যবস্থা। হয়না, বেকার সমস্যা দূরীভূত হবেনা। এজন্য অবশ্যই আপনাকে কারিগরি জ্ঞানে, হাতে-কলমে পূর্ণ দক্ষতা অর্জন করতে হবে। সামণ্ডন নাহার হারুন পলিটেকনিক ইনস্টিটিউট, চট্টগ্রাম হাতে কলমে আপনার সন্তানকে সুদক্ষ করে গড়ে তোলে। সুতরাং নিঃসন্দেহে বলা চলে এ প্রতিষ্ঠানটি আপনার সন্তানের জন্য আধার ঘরের প্রদীপ, বটবৃক্ষের ছায়ার মত। আর দেরী নয়, আর কোন হতাশা নয়, আপনার সন্তানকে সামশুন নাহার হারুন পলিটেকনিক ইনস্টিটিউট, চট্টগ্রাম-এ ভর্তি করিয়ে বেকারত্বের অভিশাপ থেকে মুক্তি দিন। দেশ গড়ার সুযোগ দিন। ",
  last_message: "জয়বাংলা - বাংলাদেশ চিরজীবী হোক।",
} as const;
